gnu-shepherd-simple-service.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-02-12 Sat 20:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Writing a basic service for GNU Guix</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Tanner Hoelzel" />
</head>
<body>
<div id="content">
<h1 class="title">Writing a basic service for GNU Guix</h1>
<p>
Let's write a service for GNU Guix that will automatically start
<a href="https://github.com/kmonad/kmonad">kmonad</a> at boot, and keep it running until shutdown.
</p>

<p>
Before we proceed, note that we could make a daemon of kmonad without
going to the trouble of writing a Guix-specific daemon: we could start
kmonad in a shell profile, write a cron job, or something else. The
user experience of these methods might be the same, but writing a
service keeps things organized and seems like the "right" way. If
nothing else, it's a great learning opportunity.
</p>

<p>
First let's read the documentation of <a href="https://guix.gnu.org/en/manual/en/guix.html">GNU Guix</a>. We see that Guix
offers "services" which extend the functionality of the operating
system. The manual says:
</p>

<blockquote>
<p>
Guix system services are connected by extensions. For instance, the
secure shell service extends the Shepherd—the initialization system,
running as PID 1—by giving it the command lines to start and stop the
secure shell daemon (see openssh-service-type); the UPower service
extends the D-Bus service by passing it its .service specification,
and extends the udev service by passing it device management rules
(see upower-service); the Guix daemon service extends the Shepherd by
passing it the command lines to start and stop the daemon, and extends
the account service by passing it a list of required build user
accounts (see Base Services).
</p>
</blockquote>

<p>
This sounds like what we want. Below, we see that the Guix daemon
defines its own "service type":
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">guix-service-type</span>
  (service-type
   (name 'guix)
   (extensions
    (list (service-extension shepherd-root-service-type guix-shepherd-service)
          (service-extension account-service-type guix-accounts)
          (service-extension activation-service-type guix-activation)))
   (default-value (guix-configuration))))
</pre>
</div>

<p>
Hm. I didn't expect we'd need to instatiate our own data type just to
create a simple init daemon. Let's look at a simpler example-I saw
some "Game Services" listed in the manual that might be pretty
simple. The definition of the games services are apparently in
<a href="https://git.savannah.gnu.org/cgit/guix.git/tree/gnu/services/games.scm">`/gnu/services/games.scm`</a>:
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #b22222;">;;; </span><span style="color: #b22222;">GNU Guix --- Functional package management for GNU</span>
<span style="color: #b22222;">;;; </span><span style="color: #b22222;">Copyright &#169; 2018 Arun Isaac <a href="mailto:arunisaac%40systemreboot.net">&lt;arunisaac@systemreboot.net&gt;</a></span>
<span style="color: #b22222;">;;;</span>
<span style="color: #b22222;">;;; </span><span style="color: #b22222;">This file is part of GNU Guix.</span>
<span style="color: #b22222;">;;;</span>
<span style="color: #b22222;">;;; </span><span style="color: #b22222;">GNU Guix is free software; you can redistribute it and/or modify it</span>
<span style="color: #b22222;">;;; </span><span style="color: #b22222;">under the terms of the GNU General Public License as published by</span>
<span style="color: #b22222;">;;; </span><span style="color: #b22222;">the Free Software Foundation; either version 3 of the License, or (at</span>
<span style="color: #b22222;">;;; </span><span style="color: #b22222;">your option) any later version.</span>
<span style="color: #b22222;">;;;</span>
<span style="color: #b22222;">;;; </span><span style="color: #b22222;">GNU Guix is distributed in the hope that it will be useful, but</span>
<span style="color: #b22222;">;;; </span><span style="color: #b22222;">WITHOUT ANY WARRANTY; without even the implied warranty of</span>
<span style="color: #b22222;">;;; </span><span style="color: #b22222;">MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the</span>
<span style="color: #b22222;">;;; </span><span style="color: #b22222;">GNU General Public License for more details.</span>
<span style="color: #b22222;">;;;</span>
<span style="color: #b22222;">;;; </span><span style="color: #b22222;">You should have received a copy of the GNU General Public License</span>
<span style="color: #b22222;">;;; </span><span style="color: #b22222;">along with GNU Guix.  If not, see <a href="http://www.gnu.org/licenses/">&lt;http://www.gnu.org/licenses/&gt;</a>.</span>

(<span style="color: #a020f0;">define-module</span> (<span style="color: #228b22;">gnu</span> services games)
  <span style="color: #483d8b;">#:use-module</span> (gnu services)
  <span style="color: #483d8b;">#:use-module</span> (gnu services shepherd)
  <span style="color: #483d8b;">#:use-module</span> (gnu packages admin)
  <span style="color: #483d8b;">#:use-module</span> (gnu packages games)
  <span style="color: #483d8b;">#:use-module</span> (gnu system shadow)
  <span style="color: #483d8b;">#:use-module</span> (guix gexp)
  <span style="color: #483d8b;">#:use-module</span> (guix modules)
  <span style="color: #483d8b;">#:use-module</span> (guix records)
  <span style="color: #483d8b;">#:use-module</span> (ice-9 match)
  <span style="color: #483d8b;">#:export</span> (wesnothd-configuration
            wesnothd-configuration?
            wesnothd-service-type))

<span style="color: #b22222;">;;;</span>
<span style="color: #b22222;">;;; </span><span style="color: #b22222;">The Battle for Wesnoth server</span>
<span style="color: #b22222;">;;;</span>

(define-record-type* <span style="color: #228b22;">&lt;wesnothd-configuration&gt;</span>
  wesnothd-configuration make-wesnothd-configuration wesnothd-configuration?
  (package wesnothd-configuration-package
           (default wesnoth-server))
  (port wesnothd-configuration-port
        (default 15000)))

(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">%wesnothd-accounts</span>
  (list (user-account
         (name <span style="color: #8b2252;">"wesnothd"</span>)
         (group <span style="color: #8b2252;">"wesnothd"</span>)
         (system? #t)
         (comment <span style="color: #8b2252;">"Wesnoth daemon user"</span>)
         (home-directory <span style="color: #8b2252;">"/var/empty"</span>)
         (shell (file-append shadow <span style="color: #8b2252;">"/sbin/nologin"</span>)))
        (user-group
         (name <span style="color: #8b2252;">"wesnothd"</span>)
         (system? #t))))

(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">wesnothd-shepherd-service</span>
  (<span style="color: #a020f0;">match-lambda</span>
    (($ <span style="color: #228b22;">&lt;wesnothd-configuration&gt;</span> package port)
     (with-imported-modules (source-module-closure
                             '((gnu build shepherd)))
       (shepherd-service
        (documentation <span style="color: #8b2252;">"The Battle for Wesnoth server"</span>)
        (provision '(wesnoth-daemon))
        (requirement '(networking))
        (modules '((gnu build shepherd)))
        (start #~(make-forkexec-constructor/container
                  (list #$(file-append package <span style="color: #8b2252;">"/bin/wesnothd"</span>)
                        <span style="color: #8b2252;">"-p"</span> #$(number-&gt;string port))
                  <span style="color: #483d8b;">#:user</span> <span style="color: #8b2252;">"wesnothd"</span> <span style="color: #483d8b;">#:group</span> <span style="color: #8b2252;">"wesnothd"</span>))
        (stop #~(make-kill-destructor)))))))

(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">wesnothd-service-type</span>
  (service-type
   (name 'wesnothd)
   (description
    <span style="color: #8b2252;">"Run The Battle for Wesnoth server @command{wesnothd}."</span>)
   (extensions
    (list (service-extension account-service-type
                             (const %wesnothd-accounts))
          (service-extension shepherd-root-service-type
                             (compose list wesnothd-shepherd-service))))
   (default-value (wesnothd-configuration))))
</pre>
</div>

<p>
The <a href="https://guix.gnu.org/manual/en/html_node/Game-Services.html">Game Services reference</a> says
</p>

<blockquote>
<p>
To run wesnothd in the default configuration, instantiate it as:
</p>

<p>
`(service wesnothd-service-type)`
</p>
</blockquote>

<p>
Based on the `service` documentation, `(service some-service-type)` is
equivalent to `(service some-service-type default-arguments)`. I can't
think of sane defaults to provide to kmonad, so let's forego defaults
and provide kmonad as `(service kmonad-service-type
kmonad-arguments)`. With that in mind, let's apply
`wesnothd-service-type` to write `kmonad-service-type`:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">kmonad-service-type</span>
  (service-type
   (name 'kmonad)
   (description
    <span style="color: #8b2252;">"Run kmonad as a daemon."</span>)
   (extensions
    (list (service-extension account-service-type
                             (const %kmonad-daemon-accounts))
          (service-extension shepherd-root-service-type
                             (compose list kmonad-shepherd-service))))))
</pre>
</div>

<p>
First let's figure out how service-extension works. The documentation
says:
</p>

<blockquote>
<p>
Scheme Procedure: service-extension target-type compute
</p>

<p>
Return a new extension for services of type target-type. compute must
be a one-argument procedure: fold-services calls it, passing it the
value associated with the service that provides the extension; it must
return a valid value for the target service.
</p>
</blockquote>

<p>
So in the context of `(define kmonad-service-type &#x2026;`, a `compute`
function will receive the (single) value associated with
`kmonad-service-type` (a value which we have yet to define) and will
return the value required by the extended service
`target-type`. According to the docs, <a href="https://guix.gnu.org/manual/en/html_node/Service-Types-and-Services.html">`account-service-type`</a> gets
extended with a list of `user-group` and `user-account` objects;
<a href="https://guix.gnu.org/manual/en/html_node/Shepherd-Services.html">`shepherd-root-service-type`</a> gets extended with a list of
`&lt;shepherd-service&gt;`. We should be ready to define
`%kmonad-daemon-accounts`:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">%kmonad-daemon-accounts</span>
  (list (user-account
         (name <span style="color: #8b2252;">"kmonad-daemon"</span>)
         (group <span style="color: #8b2252;">"kmonad-daemon"</span>)
         (system? #t)
         (comment <span style="color: #8b2252;">"kmonad daemon user"</span>)
         (home-directory <span style="color: #8b2252;">"/var/empty"</span>)
         (shell (file-append shadow <span style="color: #8b2252;">"/sbin/nologin"</span>)))
        (user-group
         (name <span style="color: #8b2252;">"kmonad-daemon"</span>)
         (system? #t))))
</pre>
</div>

<p>
It's recommended to make a dedicated user and group for each service
(see <a href="https://unix.stackexchange.com/questions/29159/why-is-it-recommended-to-create-a-group-and-user-for-some-applications">stackoverflow</a>) so we will do the same with kmonad. It's also a
good idea to disable login from this dedicated user by setting the
default shell to `/sbin/nologin` (see `man 8 nologin`). Now, `(const
%kmonad-daemon-accounts)` will evaluate to a function that takes some
argument&#x2013;specifically whichever argument is passed to it by
`fold-services`&#x2013;and return our newly-defined list of `user-account`
and `user-group` objects. We've finished extending
`account-service-type`.
</p>

<p>
Now let's extend `shepherd-root-service-type`. That means implementing
`kmonad-shepherd-service` so that it takes whatever single argument we
want it to, and outputs something that, when passed to `list`, yields
a list of `&lt;shepherd-service&gt;`&#x2013;in other words, a single
&lt;shepherd-service&gt;. Before we write the function, let's decide what we
want to pass to `kmonad-shepherd-service`. Minimally, kmonad needs a
`.kbd` file to run. In theory, a user could also specify a user
account to run the daemon, or a log level, or a log output
location. But let's just start with the `.kbd` path as the single
argument:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">kmonad-shepherd-service</span> kbd-path)
  (shepherd-service
   (documentation <span style="color: #8b2252;">"Run the kmonad daemon (kmonad-daemon)."</span> )
   (provision '(kmonad-daemon))
   (requirement '(udev user-processes))
   (start #~(make-forkexec-constructor
             (list #$(file-append kmonad <span style="color: #8b2252;">"/bin/kmonad"</span>)
                   #$kbd-path <span style="color: #8b2252;">"-l info"</span>)
             <span style="color: #483d8b;">#:user</span> <span style="color: #8b2252;">"kmonad-daemon"</span> <span style="color: #483d8b;">#:group</span> <span style="color: #8b2252;">"kmonad-daemon"</span>
             <span style="color: #483d8b;">#:log-file</span> <span style="color: #8b2252;">"/var/log/kmonad.log"</span>))
   (stop #~(make-kill-destructor))))
</pre>
</div>

<p>
We definitely need to wait for `udev`, but maybe we should also wait
for `user-processes` like the other daemons in the shepherd graph seem
to. Looking at the <a href="https://git.savannah.gnu.org/cgit/guix.git/tree/gnu/services/shepherd.scm">source</a> for `user-processes`:
</p>

<blockquote>
<p>
This is a synchronization point used to make sure user processes and daemons
get started only after crucial initial services have been started&#x2014;file
system mounts, etc.  This is similar to the 'sysvinit' target in systemd.
</p>
</blockquote>

<p>
In theory we could explicitly wait for other shepherd services, but it
seems like this is a catch-all that applies perfectly to the
circumstance. Come to think of it, I wonder why `wesnothd` doesn't
depend on `user-processes` too. Finally, we need to specify the
`start` and `stop` fields. The <a href="https://git.savannah.gnu.org/cgit/guix.git/tree/gnu/build/shepherd.scm">source</a> for
`make-forkexec-constructor/container` include:
</p>

<blockquote>
<p>
This is a variant of 'make-forkexec-constructor' that starts COMMAND in
NAMESPACES, a list of Linux namespaces such as '(mnt ipc).  MAPPINGS is the
list of &lt;file-system-mapping&gt; to make in the case of a separate mount
namespace, in addition to essential bind-mounts such /proc.
</p>
</blockquote>

<p>
Wherease the <a href="https://www.gnu.org/software/shepherd/manual/html_node/Service-De_002d-and-Constructors.html#Service-De_002d-and-Constructors">docs</a> for `make-forkexec-contructor` reads:
</p>

<blockquote>
<p>
Return a procedure that forks a child process, closes all file
descriptors except the standard output and standard error descriptors,
sets the current directory to directory, sets the umask to
file-creation-mask unless it is #f, changes the environment to
environment-variables (using the environ procedure), sets the current
user to user and the current group to group unless they are #f, and
executes command (a list of strings.) The result of the procedure will
be the PID of the child process. Note that this will not work as
expected if the process “daemonizes” (forks); in that case, you will
need to pass #:pid-file, as explained below.
</p>

<p>
When pid-file is true, it must be the name of a PID file associated
with the process being launched; the return value is the PID once that
file has been created. If pid-file does not show up in less than
pid-file-timeout seconds, the service is considered as failing to
start.
</p>

<p>
When log-file is true, it names the file to which the service’s
standard output and standard error are redirected. log-file is created
if it does not exist, otherwise it is appended to.
</p>
</blockquote>

<p>
The `wesnoth` source appears not to use the `NAMESPACES` feature of
the containerized-version, so we'll stick with
`make-forexec-constructor` as is used in the <a href="https://guix.gnu.org/manual/en/html_node/Shepherd-Services.html">syslogd example</a>.
</p>

<p>
Putting it all together, and adding imports, we have:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #a020f0;">define-module</span> (<span style="color: #228b22;">my</span> services kmonad)
  <span style="color: #483d8b;">#:use-module</span> (gnu services)
  <span style="color: #483d8b;">#:use-module</span> (gnu services shepherd)
  <span style="color: #483d8b;">#:use-module</span> (gnu packages haskell-apps)
  <span style="color: #483d8b;">#:use-module</span> (gnu system shadow)
  <span style="color: #483d8b;">#:use-module</span> (guix gexp)
  <span style="color: #483d8b;">#:export</span> (kmonad-service-type))

(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">%kmonad-daemon-accounts</span>
  (list (user-account
         (name <span style="color: #8b2252;">"kmonad-daemon"</span>)
         (group <span style="color: #8b2252;">"kmonad-daemon"</span>)
         (system? #t)
         (comment <span style="color: #8b2252;">"kmonad daemon user"</span>)
         (home-directory <span style="color: #8b2252;">"/var/empty"</span>)
         (shell (file-append shadow <span style="color: #8b2252;">"/sbin/nologin"</span>)))
        (user-group
         (name <span style="color: #8b2252;">"kmonad-daemon"</span>)
         (system? #t))))

(<span style="color: #a020f0;">define</span> (<span style="color: #0000ff;">kmonad-shepherd-service</span> kbd-path)
  (shepherd-service
   (documentation <span style="color: #8b2252;">"Run the kmonad daemon (kmonad-daemon)."</span> )
   (provision '(kmonad-daemon))
   (requirement '(udev user-processes))
   (start #~(make-forkexec-constructor
             (list #$(file-append kmonad <span style="color: #8b2252;">"/bin/kmonad"</span>)
                   #$kbd-path <span style="color: #8b2252;">"-l info"</span>)
             <span style="color: #483d8b;">#:user</span> <span style="color: #8b2252;">"kmonad-daemon"</span> <span style="color: #483d8b;">#:group</span> <span style="color: #8b2252;">"kmonad-daemon"</span>
             <span style="color: #483d8b;">#:log-file</span> <span style="color: #8b2252;">"/var/log/kmonad.log"</span>))
   (stop #~(make-kill-destructor))))

(<span style="color: #a020f0;">define</span> <span style="color: #0000ff;">kmonad-service-type</span>
  (service-type
   (name 'kmonad)
   (description
    <span style="color: #8b2252;">"Run kmonad as a daemon."</span>)
   (extensions
    (list (service-extension account-service-type
                             (const %kmonad-daemon-accounts))
          (service-extension shepherd-root-service-type
                             (compose list kmonad-shepherd-service))))))
</pre>
</div>

<p>
If the location where we keep local guix modules is `~/local-guix`,
then we can save the above file as
`~/local-guix/my/services/kmonad.scm`. Now we can adjust our system
config to use the new service type:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(use-modules (gnu))
(use-package-modules haskell-apps) <span style="color: #b22222;">;; </span><span style="color: #b22222;">contains kmonad</span>
(use-modules (my services kmonad))
<span style="color: #b22222;">;; </span><span style="color: #b22222;">more modules</span>

(operating-system
  (users
    (append (list (user-account
                     (supplementary-groups
                       '(<span style="color: #8b2252;">"input"</span> <span style="color: #b22222;">;; </span><span style="color: #b22222;">needed by kmonad</span>
                         <span style="color: #b22222;">;; </span><span style="color: #b22222;">more groups</span>
                         ))
                     <span style="color: #b22222;">;; </span><span style="color: #b22222;">more fields</span>
                   )
                   <span style="color: #b22222;">;; </span><span style="color: #b22222;">more users</span>
            )
            %base-user-accounts))
  (packages
    (append (list <span style="color: #8b2252;">"kmonad"</span>
             <span style="color: #b22222;">;; </span><span style="color: #b22222;">more packages</span>
            )
            %base-packages))
  (services
    (append (list (kmonad-service <span style="color: #8b2252;">"/path/to/config.kbd"</span>)
                  <span style="color: #b22222;">;; </span><span style="color: #b22222;">more services</span>
            )
            (modify-services %desktop-services <span style="color: #b22222;">;; </span><span style="color: #b22222;">needed to add kmonad udev rules</span>
              (udev-service-type config =&gt;
                (udev-configuration (inherit config)
                  (rules (cons kmonad
                    (udev-configuration-rules config))))))))
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">more fields</span>
)
</pre>
</div>

<p>
And reconfigure:
</p>

<div class="org-src-container">
<pre class="src src-bash">sudo guix system -L ~/local-guix reconfigure /path/to/config.scm
</pre>
</div>

<p>
Final thoughts
</p>
<ul class="org-ul">
<li>Perhaps we could have added kmonad as a `simple-service` on top of
mcron?</li>
<li>We could submit this as a package to guix</li>
</ul>
</div>
</body>
</html>
